# Экзамен по курсу "Аналитика данных на Python"

Этот тест проверит Ваши навыки работы с таблицами данных с помощью библиотек pandas и numpy. Задания делятся на простые (⭐️), средние (⭐️⭐️) и сложные (⭐️⭐️⭐️). Решение простых заданий, как правило, требует одной-двух операций с таблицами, тогда как для более сложных может потребоваться несколько последовательных преобразований данных.

##  Предыстория

Сегодня Ваш первый день работы в крупном интернет-магазине, который продаёт товары с доставкой по всему миру. Ваша первая задача – проанализировать базу данных покупок, совершённых в магазине за последние несколько лет. База содержит информацию об отдельных транзакциях, про каждую из которых известны номер инвойса (InvoiceNo), дата инвойса(InvoiceDate), код товара (StockCode), описание товара(Description), количество товара в транзакции (Quantity), стоимость единицы товара (UnitPrice), код покупателя (CustomerID), страна покупателя (Country).

База выгружена для Вас в формате CSV: файл [```online-retail.csv```](https://drive.google.com/file/d/1O1oJtpEu-u6s6xTu7seQfnNcQjYCt0GF/view?usp=sharing)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## ⭐️ Вопрос 1

Загрузите данные из файла online-retail.csv в переменную типа pandas DataFrame

Подсказка: Используйте функцию из библиотеки pandas

Какой символ-разделитель используется в этом файле?

* Запятая ","
* Двоеточие ":"
* Точка с запятой ";"
* Символ табуляции "tab"

#### Решение

In [2]:
df = pd.read_csv('online-retail.csv', sep=';')
df.head()

# Точка с запятой ";"

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

## ⭐️ Вопрос 2

Сколько строк в полученной таблице (не считая заголовков столбцов)?

#### Решение

In [3]:
df.info()

# 541911

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541911 entries, 0 to 541910
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541911 non-null  object
 1   StockCode    541911 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541911 non-null  int64
 4   InvoiceDate  541911 non-null  object
 5   UnitPrice    541911 non-null  float64
 6   CustomerID   406831 non-null  float64
 7   Country      541911 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

## ⭐️ Вопрос 3

Сколько столбцов в полученной таблице (не считая индекса)?

#### Решение

In [4]:
# 8 (из инфо выше)

## ⭐️ Вопрос 4

Как называется столбец с самым коротким названием?

#### Решение

In [5]:
min(list(df.columns))

'Country'

## ⭐️ Вопрос 5

В скольких столбцах встречаются пропущенные значения? (ответ - целое число)

#### Решение

In [6]:
df.isnull().sum()

# 2

InvoiceNo           0
StockCode           0
Description      1455
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

## ⭐️ Вопрос 6

Сколько пропущенных значений в столбце CustomerID? (ответ - целое число)

#### Решение

In [7]:
# 135080

## ⭐️⭐️ Вопрос 7

Посмотрим, данные за какой исторический период у нас есть. 

Данные за какой самый ранний и за какой самый поздний годы содержатся в датасете? В ответе укажите два целых числа через запятую.

#### Решение

In [8]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])
print(df.dtypes)

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
dtype: object

In [9]:
df4 = df.sort_values(by='InvoiceDate')
df4

# 2010, 2011

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541896,581587,22555,PLASTERS IN TIN STRONGMAN,12,2011-12-09 12:50:00,1.65,12680.0,France
541894,581587,22631,CIRCUS PARADE LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541901,581587,22367,CHILDRENS APRON SPACEBOY DESIGN,8,2011-12-09 12:50:00,1.95,12680.0,France
541909,581588,22380,TOY TIDY SPACEBOY,9,2011-12-09 12:52:00,2.10,12594.0,Italy
541910,581588,22381,TOY TIDY PINK POLKADOT,9,2011-12-09 12:52:00,2.10,12594.0,Italy

## ⭐️ Вопрос 8

Каковы минимальная и максимальная цена товаров (UnitPrice)? Перечислите через запятую. Цена в этом задании может принимать отрицательные значения.

#### Решение

In [10]:
df['UnitPrice'].min()

-11062.06

In [11]:
df['UnitPrice'].max()

38970.0

In [12]:
# -11062.06, 38970.0

## ⭐️ Вопрос 9

В таблице оказались товары с отрицательными ценами! Это явно какая-то ошибка. Какое описание (Description) у таких транзакций? Перечислите все варианты через запятую, отсортировав строки по алфавиту.

#### Решение

In [13]:
df1 = df[df['UnitPrice'] < 0]
df1

# Adjust bad debt, Adjust bad debt

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299983,A563186,B,Adjust bad debt,1,2011-08-12 14:51:00,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,2011-08-12 14:52:00,-11062.06,NaN,United Kingdom

## ⭐️ Вопрос 10

Поищем ещё возможные проблемы с данными. Как насчёт товаров с нулевыми ценами? 

Сколько в таблице транзакций с нулевой ценой? А с пропусками на месте цены? 

Перечислите два целых числа через запятую.

#### Решение

In [14]:
df2 = df[df['UnitPrice'] == 0].count()['UnitPrice']
df2

2515

In [15]:
df.isnull().sum()

# 2515, 0

InvoiceNo           0
StockCode           0
Description      1455
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

## ⭐️⭐️ Вопрос 11

Для дальнейшего анализа поведения покупателей нам понадобится набор данных, в которых у каждой транзакции корректно указана цена, количество единиц товара (Quantity) и id покупателя (CustomerID). Удалите из таблицы все строки, в которых цена не превосходит 0 или пропущена, или количество единиц товара не превосходит 0 или пропущено, или в которых пропущен id покупателя. 

Сколько строк осталось?

#### Решение

In [16]:
df.dropna(axis=0, subset=['Quantity', 'UnitPrice', 'CustomerID'], inplace=True)
df3 = df[(df['UnitPrice'] > 0) & (df['Quantity'] > 0)]
df3.info()

# 397886

<class 'pandas.core.frame.DataFrame'>
Int64Index: 397886 entries, 0 to 541910
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397886 non-null  object
 1   StockCode    397886 non-null  object
 2   Description  397886 non-null  object
 3   Quantity     397886 non-null  int64
 4   InvoiceDate  397886 non-null  datetime64[ns]
 5   UnitPrice    397886 non-null  float64
 6   CustomerID   397886 non-null  float64
 7   Country      397886 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.3+ MB

## Внимание! 

### Везде далее мы работаем с очищенной таблицей, полученной в Вопросе 11.

## ⭐️⭐️ Вопрос 12

В таблице для каждой транзакции указаны цена за единицу товара (UnitPrice) и количество единиц товара (Quantity). Вычислите для каждой транзакции её **полную стоимость** и сохраните в новом столбце Price, который добавьте в таблицу. 

Каковы минимальная и максимальная полная стоимость транзакций? Перечислите через запятую, округлив до целых чисел.

#### Решение

In [17]:
df3['Price'] = df3['UnitPrice'] * df['Quantity']
df3.head()

<ipython-input-17-f8aeffa6946b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Price'] = df3['UnitPrice'] * df['Quantity']

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [18]:
round(df3['Price'].min())

0

In [19]:
round(df3['Price'].max())

# 0, 168470

168470

## ⭐️⭐️ Вопрос 13

В нашей базе данных каждая покупка представлена одной или несколькими транзакциями. Покупка однозначно определяется своим номером инвойса (InvoiceNo). Транзакции, относящиеся к одной покупке, имеют один и тот же InvoiceNo. 

Стоимость всей покупки равна сумме полных стоимостей транзакций, входящих в неё. Найдите стоимости трёх самых дорогих покупок. Перечислите через запятую в порядке убывания, округлив до целых чисел.

#### Решение

In [20]:
df3.groupby(['InvoiceNo']).agg('sum')['Price'].sort_values(ascending=False)

# 168470, 77184, 38970

InvoiceNo
581483    168469.60
541431     77183.60
556444     38970.00
567423     31698.16
556917     22775.93
            ...
538669         0.95
540945         0.85
542736         0.55
567869         0.40
570554         0.38
Name: Price, Length: 18533, dtype: float64

## ⭐️⭐️ Вопрос 14

Какой товар составил наибольшую выручку? В ответе укажите описание товара (дословно строку из соответствующего поля в столбце Description).

#### Решение

In [21]:
df3[df3['Price'] == 168469.60]

# PAPER CRAFT , LITTLE BIRDIE

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,2011-12-09 09:15:00,2.08,16446.0,United Kingdom,168469.6

## ⭐️⭐️ Вопрос 15

Создайте новую таблицу purchases, в которой каждая строка будет соответствовать отдельной покупке, со столбцами 
InvoiceNo, InvoiceDate, Price, CustomerID, Country.

Поскольку дата InvoiceDate может быть отличаться для разных транзакций внутри одной покупки, при группировке возьмите самую раннюю из дат. Также отсортируйте её по датам по возрастанию.

Учтите, что InvoiceDate — не уникальное поле, данные стоит дополнительно отсортировать по InvoiceNo, перед тем как брать первое значение группы.

Сколько получилось строк?

#### Решение

In [22]:
purchases = df3.groupby(['InvoiceNo']).agg({'InvoiceDate': 'min', 'Price': 'sum', 'CustomerID': 'first', 'Country': 'first'}) 
purchases

# 18533

                  InvoiceDate   Price  CustomerID         Country
InvoiceNo
536365    2010-12-01 08:26:00  139.12     17850.0  United Kingdom
536366    2010-12-01 08:28:00   22.20     17850.0  United Kingdom
536367    2010-12-01 08:34:00  278.73     13047.0  United Kingdom
536368    2010-12-01 08:34:00   70.05     13047.0  United Kingdom
536369    2010-12-01 08:35:00   17.85     13047.0  United Kingdom
...                       ...     ...         ...             ...
581584    2011-12-09 12:25:00  140.64     13777.0  United Kingdom
581585    2011-12-09 12:31:00  329.05     15804.0  United Kingdom
581586    2011-12-09 12:49:00  339.20     13113.0  United Kingdom
581587    2011-12-09 12:50:00  249.45     12680.0          France
581588    2011-12-09 12:52:00   37.80     12594.0           Italy

[18533 rows x 4 columns]

## ⭐️⭐️ Вопрос 16

Исследуем, растут или убывают покупки наших клиентов после их первой покупки на сайте. Найдите среднюю цену первых покупок клиентов: для каждого клиента возьмите его первую покупку и усредните эти значения. Найдите среднюю цену покупок в целом. Округлите эти числа до целых и перечислите в этом порядке через запятую.

\* При равных TimeStamp по покупкам первой считается покупка с меньшим InvoiceNo.

#### Решение

In [23]:
round(purchases.groupby('CustomerID').agg({'Price': 'first'}).mean())

Price    426.0
dtype: float64

In [24]:
round(purchases['Price'].mean())

# 426, 481

481

## ⭐️⭐️⭐️ Вопрос 17

В какой день недели было наибольшее число покупок? В ответе укажите русское название дня недели, начинающееся с заглавной буквы.


Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите день недели, в который она была совершена. Сохраните в новый столбец.
* Сгруппируйте таблицу по дням недели.

#### Решение

In [25]:
purchases['InvoiceDate'] = pd.to_datetime(purchases['InvoiceDate'])
purchases['Day_of_week'] = purchases['InvoiceDate'].dt.day_name()
purchases.groupby('Day_of_week').count().sort_values(by='InvoiceDate', ascending=False)

# Четверг

             InvoiceDate  Price  CustomerID  Country
Day_of_week
Thursday            4032   4032        4032     4032
Wednesday           3455   3455        3455     3455
Tuesday             3184   3184        3184     3184
Monday              2863   2863        2863     2863
Friday              2830   2830        2830     2830
Sunday              2169   2169        2169     2169

## ⭐️⭐️⭐️ Вопрос 18

В какой год и месяц выручка была максимальной?

Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите год и месяц, в которые она была совершена. Сохраните в новые столбцы.
* Сгруппируйте таблицу по новым столбцам

В ответе укажите два целых числа через запятую: год, месяц

#### Решение

In [28]:
purchases['year'] = purchases['InvoiceDate'].dt.year
purchases['month'] = purchases['InvoiceDate'].dt.month
purchases.groupby(['year', 'month'])['Price'].sum()

# 2011, 11

year  month
2010  12        572713.890
2011  1         569445.040
      2         447137.350
      3         595500.760
      4         469200.361
      5         678594.560
      6         661213.690
      7         600091.011
      8         645343.900
      9         952838.382
      10       1039318.790
      11       1161817.380
      12        518230.590
Name: Price, dtype: float64

## ⭐️⭐️⭐️ Вопрос 19

Магазин продаёт товары покупателям из разных стран (Country). В какой стране был наибольший процентный рост месячных продаж, если сравнить март 2011 и сентябрь 2011? Сколько процентов составил этот рост? В расчёт брать только страны, в которых были ненулевые продажи в обоих этих месяцах. В ответе укажите через запятую название страны и целое число (процентный рост, округлённый до целого числа).

#### Решение

In [29]:
purchases.head(3)

,InvoiceDate,Price,CustomerID,Country,Day_of_week,year,month
InvoiceNo,,,,,,,
536365,2010-12-01 08:26:00,139.12,17850.0,United Kingdom,Wednesday,2010,12
536366,2010-12-01 08:28:00,22.20,17850.0,United Kingdom,Wednesday,2010,12
536367,2010-12-01 08:34:00,278.73,13047.0,United Kingdom,Wednesday,2010,12

In [32]:
grouped = purchases.groupby(['Country', 'year', 'month'])['Price'].sum().reset_index()
grouped.head()

     Country  year  month     Price
0  Australia  2010     12   1032.85
1  Australia  2011      1   9017.71
2  Australia  2011      2  14695.42
3  Australia  2011      3  17223.99
4  Australia  2011      4    771.60

In [33]:
grouped_limited = grouped.query('year == 2011 and ((month == 3) or (month == 9))')
grouped_limited.head()

      Country  year  month     Price
3   Australia  2011      3  17223.99
9   Australia  2011      9   5106.73
14    Austria  2011      3   1708.12
26    Belgium  2011      3   3351.98
32    Belgium  2011      9   4208.02

In [34]:
pivoted = pd.pivot_table(grouped_limited, index='Country', columns=['month'], values='Price').reset_index()
pivoted.head()

month          Country         3        9
0            Australia  17223.99  5106.73
1              Austria   1708.12      NaN
2              Belgium   3351.98  4208.02
3               Canada    140.54      NaN
4      Channel Islands   3509.33  1323.75

In [36]:
pivoted['percent_changed'] = round((pivoted[9] / pivoted[3]) * 100 - 100)
pivoted = pivoted.sort_values('percent_changed')
pivoted.head()

month          Country         3        9  percent_changed
12               Italy   1806.81   279.80            -85.0
8              Finland   5936.82  1105.45            -81.0
5               Cyprus    938.39   196.35            -79.0
0            Australia  17223.99  5106.73            -70.0
4      Channel Islands   3509.33  1323.75            -62.0

In [ ]:
# Italy, 85

## ⭐️⭐️⭐️ Вопрос 20

Большинство клиентов все свои покупки делают из одной и той же страны. Выясним, однако, насколько велика доля путешественников среди клиентов. 
Сколько клиентов сделали покупки по крайней мере из двух разных стран? (ответ - целое число)

#### Решение

In [37]:
(purchases[['Country', 'CustomerID']].drop_duplicates().groupby('CustomerID').count() > 1).sum()

Country    8
dtype: int64

## ⭐️⭐️⭐️ Вопрос 21

Мы запускаем в Италии рекомендательную систему "С этим товаром часто покупают...", и для этого хотим узнать, какие различные товары чаще всего встречаются в одной покупке из этой страны. Определите, какая пара различных товаров чаще всего встречается в различных покупках с ```Country=='Italy'```, и в скольких покупках это происходит. Одинаковые товары или нет, проверяйте по равенству поля Description. 

(ответ: название (Description) первого товара, название (Description) второго товара, целое число)

#### Решение

In [43]:
# Выберем только покупки, относящиеся к Италии:
df_italy = df[df['Country'] == 'Italy']
df_italy.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
7214,537022,22791,T-LIGHT GLASS FLUTED ANTIQUE,12,2010-12-03 15:45:00,1.25,12725.0,Italy
7215,537022,21287,SCENTED VELVET LOUNGE CANDLE,12,2010-12-03 15:45:00,1.25,12725.0,Italy
7216,537022,79337,BLUE FLOCK GLASS CANDLEHOLDER,6,2010-12-03 15:45:00,1.65,12725.0,Italy
7217,537022,85111,SILVER GLITTER FLOWER VOTIVE HOLDER,12,2010-12-03 15:45:00,1.25,12725.0,Italy
7218,537022,85038,6 CHOCOLATE LOVE HEART T-LIGHTS,6,2010-12-03 15:45:00,2.10,12725.0,Italy

In [44]:
# Составим таблицу из пар товаров, встречавшихся в одной покупке
# Для этого объединим таблицу транзакций саму с собой по ключу InvoiceNo:
df_merged = pd.merge(df_italy[['InvoiceNo', 'Description']], df_italy[['InvoiceNo', 'Description']], 
                     on='InvoiceNo', how='inner')
df_merged.head()

  InvoiceNo                 Description_x                        Description_y
0    537022  T-LIGHT GLASS FLUTED ANTIQUE         T-LIGHT GLASS FLUTED ANTIQUE
1    537022  T-LIGHT GLASS FLUTED ANTIQUE         SCENTED VELVET LOUNGE CANDLE
2    537022  T-LIGHT GLASS FLUTED ANTIQUE        BLUE FLOCK GLASS CANDLEHOLDER
3    537022  T-LIGHT GLASS FLUTED ANTIQUE  SILVER GLITTER FLOWER VOTIVE HOLDER
4    537022  T-LIGHT GLASS FLUTED ANTIQUE      6 CHOCOLATE LOVE HEART T-LIGHTS

In [ ]:
# Вычислим, сколько раз встречается каждая пара, и возьмем самую частую:
df_merged.groupby(['Description_x', 'Description_y'].count().sort_values(by='InvoiceNo', ascending=False))